paper/get_set_benchmark/raw/redis-get-set-1-3.txt
4         Threads
64        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       822752.29          ---          ---         4.97215         5.11900         5.91900         6.52700     62581.10 
Gets      2468256.87   2257118.88    211137.98         4.97215         5.11900         5.91900         6.52700    168679.76 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    3291009.16   2257118.88    211137.98         4.97215         5.11900         5.91900         6.52700    231260.86 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.031        0.000
SET       3.135        5.000
SET       4.415       10.000
SET       4.671       15.000
SET       4.767       20.000
SET       4.831       25.000
SET       4.895       30.000
SET       4.959       35.000
SET       5.023       40.000
SET       5.055       45.000
SET       5.119       50.000
SET       5.151       52.500
SET       5.183       55.000
SET       5.215       57.500
SET       5.247       60.000
SET       5.247       62.500
SET       5.279       65.000
SET       5.311       67.500
SET       5.343       70.000
SET       5.375       72.500
SET       5.407       75.000
SET       5.407       76.250
SET       5.439       77.500
SET       5.439       78.750
SET       5.471       80.000
SET       5.471       81.250
SET       5.503       82.500
SET       5.503       83.750
SET       5.535       85.000
SET       5.535       86.250
SET       5.567       87.500
SET       5.567       88.125
SET       5.599       88.750
SET       5.599       89.375
SET       5.599       90.000
SET       5.631       90.625
SET       5.631       91.250
SET       5.631       91.875
SET       5.663       92.500
SET       5.663       93.125
SET       5.695       93.750
SET       5.695       94.062
SET       5.695       94.375
SET       5.695       94.688
SET       5.727       95.000
SET       5.727       95.312
SET       5.727       95.625
SET       5.759       95.938
SET       5.759       96.250
SET       5.759       96.562
SET       5.791       96.875
SET       5.791       97.031
SET       5.791       97.188
SET       5.791       97.344
SET       5.823       97.500
SET       5.823       97.656
SET       5.823       97.812
SET       5.823       97.969
SET       5.855       98.125
SET       5.855       98.281
SET       5.887       98.438
SET       5.887       98.516
SET       5.887       98.594
SET       5.887       98.672
SET       5.887       98.750
SET       5.919       98.828
SET       5.919       98.906
SET       5.919       98.984
SET       5.951       99.062
SET       5.951       99.141
SET       5.983       99.219
SET       5.983       99.258
SET       5.983       99.297
SET       5.983       99.336
SET       6.015       99.375
SET       6.015       99.414
SET       6.015       99.453
SET       6.047       99.492
SET       6.047       99.531
SET       6.079       99.570
SET       6.079       99.609
SET       6.111       99.629
SET       6.111       99.648
SET       6.143       99.668
SET       6.143       99.688
SET       6.175       99.707
SET       6.175       99.727
SET       6.207       99.746
SET       6.207       99.766
SET       6.239       99.785
SET       6.271       99.805
SET       6.303       99.814
SET       6.303       99.824
SET       6.335       99.834
SET       6.335       99.844
SET       6.367       99.854
SET       6.399       99.863
SET       6.431       99.873
SET       6.463       99.883
SET       6.495       99.893
SET       6.527       99.902
SET       6.559       99.907
SET       6.559       99.912
SET       6.591       99.917
SET       6.623       99.922
SET       6.655       99.927
SET       6.687       99.932
SET       6.719       99.937
SET       6.783       99.941
SET       6.815       99.946
SET       6.847       99.951
SET       6.879       99.954
SET       6.911       99.956
SET       6.943       99.958
SET       6.975       99.961
SET       7.007       99.963
SET       7.039       99.966
SET       7.071       99.968
SET       7.135       99.971
SET       7.167       99.973
SET       7.231       99.976
SET       7.263       99.977
SET       7.295       99.978
SET       7.327       99.979
SET       7.359       99.980
SET       7.391       99.982
SET       7.423       99.983
SET       7.455       99.984
SET       7.519       99.985
SET       7.551       99.987
SET       7.615       99.988
SET       7.647       99.988
SET       7.679       99.989
SET       7.711       99.990
SET       7.743       99.990
SET       7.775       99.991
SET       7.807       99.991
SET       7.871       99.992
SET       7.903       99.993
SET       7.935       99.993
SET       7.999       99.994
SET       8.031       99.994
SET       8.063       99.995
SET       8.095       99.995
SET       8.159       99.995
SET       8.191       99.995
SET       8.255       99.996
SET       8.255       99.996
SET       8.319       99.996
SET       8.383       99.997
SET       8.447       99.997
SET       8.511       99.997
SET       8.511       99.997
SET       8.575       99.997
SET       8.575       99.998
SET       8.639       99.998
SET       8.639       99.998
SET       8.703       99.998
SET       8.767       99.998
SET       8.767       99.998
SET       8.831       99.998
SET       8.831       99.999
SET       8.895       99.999
SET       8.959       99.999
SET       8.959       99.999
SET       9.023       99.999
SET       9.023       99.999
SET       9.087       99.999
SET       9.087       99.999
SET       9.151       99.999
SET       9.215       99.999
SET       9.215       99.999
SET       9.279       99.999
SET       9.343       99.999
SET       9.343       99.999
SET       9.343       99.999
SET       9.407       99.999
SET       9.407      100.000
SET       9.407      100.000
SET       9.471      100.000
SET       9.471      100.000
SET       9.471      100.000
SET       9.535      100.000
SET       9.535      100.000
SET       9.535      100.000
[...]
SET       9.599      100.000
SET       9.599      100.000
SET       9.599      100.000
SET       9.663      100.000
SET       9.663      100.000
SET       9.663      100.000
[...]
SET       9.727      100.000
SET       9.727      100.000
---
GET       0.031        0.000
GET       3.135        5.000
GET       4.415       10.000
GET       4.671       15.000
GET       4.767       20.000
GET       4.831       25.000
GET       4.895       30.000
GET       4.959       35.000
GET       5.023       40.000
GET       5.055       45.000
GET       5.119       50.000
GET       5.151       52.500
GET       5.183       55.000
GET       5.215       57.500
GET       5.247       60.000
GET       5.247       62.500
GET       5.279       65.000
GET       5.311       67.500
GET       5.343       70.000
GET       5.375       72.500
GET       5.407       75.000
GET       5.407       76.250
GET       5.439       77.500
GET       5.439       78.750
GET       5.471       80.000
GET       5.471       81.250
GET       5.503       82.500
GET       5.503       83.750
GET       5.535       85.000
GET       5.535       86.250
GET       5.567       87.500
GET       5.567       88.125
GET       5.599       88.750
GET       5.599       89.375
GET       5.599       90.000
GET       5.631       90.625
GET       5.631       91.250
GET       5.631       91.875
GET       5.663       92.500
GET       5.663       93.125
GET       5.695       93.750
GET       5.695       94.062
GET       5.695       94.375
GET       5.695       94.688
GET       5.727       95.000
GET       5.727       95.312
GET       5.727       95.625
GET       5.759       95.938
GET       5.759       96.250
GET       5.759       96.562
GET       5.791       96.875
GET       5.791       97.031
GET       5.791       97.188
GET       5.791       97.344
GET       5.823       97.500
GET       5.823       97.656
GET       5.823       97.812
GET       5.823       97.969
GET       5.855       98.125
GET       5.855       98.281
GET       5.887       98.438
GET       5.887       98.516
GET       5.887       98.594
GET       5.887       98.672
GET       5.887       98.750
GET       5.919       98.828
GET       5.919       98.906
GET       5.919       98.984
GET       5.951       99.062
GET       5.951       99.141
GET       5.983       99.219
GET       5.983       99.258
GET       5.983       99.297
GET       5.983       99.336
GET       6.015       99.375
GET       6.015       99.414
GET       6.015       99.453
GET       6.047       99.492
GET       6.047       99.531
GET       6.079       99.570
GET       6.079       99.609
GET       6.111       99.629
GET       6.111       99.648
GET       6.143       99.668
GET       6.143       99.688
GET       6.175       99.707
GET       6.175       99.727
GET       6.207       99.746
GET       6.207       99.766
GET       6.239       99.785
GET       6.271       99.805
GET       6.303       99.814
GET       6.303       99.824
GET       6.335       99.834
GET       6.335       99.844
GET       6.367       99.854
GET       6.399       99.863
GET       6.431       99.873
GET       6.463       99.883
GET       6.495       99.893
GET       6.527       99.902
GET       6.559       99.907
GET       6.559       99.912
GET       6.591       99.917
GET       6.623       99.922
GET       6.655       99.927
GET       6.687       99.932
GET       6.719       99.937
GET       6.783       99.941
GET       6.815       99.946
GET       6.847       99.951
GET       6.879       99.954
GET       6.911       99.956
GET       6.943       99.958
GET       6.975       99.961
GET       7.007       99.963
GET       7.039       99.966
GET       7.071       99.968
GET       7.135       99.971
GET       7.167       99.973
GET       7.231       99.976
GET       7.263       99.977
GET       7.295       99.978
GET       7.327       99.979
GET       7.359       99.980
GET       7.391       99.982
GET       7.423       99.983
GET       7.455       99.984
GET       7.519       99.985
GET       7.551       99.987
GET       7.615       99.988
GET       7.647       99.988
GET       7.679       99.989
GET       7.711       99.990
GET       7.743       99.990
GET       7.775       99.991
GET       7.807       99.991
GET       7.871       99.992
GET       7.903       99.993
GET       7.935       99.993
GET       7.999       99.994
GET       8.031       99.994
GET       8.063       99.995
GET       8.095       99.995
GET       8.159       99.995
GET       8.191       99.995
GET       8.255       99.996
GET       8.255       99.996
GET       8.319       99.996
GET       8.383       99.997
GET       8.447       99.997
GET       8.511       99.997
GET       8.511       99.997
GET       8.575       99.997
GET       8.575       99.998
GET       8.639       99.998
GET       8.639       99.998
GET       8.703       99.998
GET       8.767       99.998
GET       8.767       99.998
GET       8.831       99.998
GET       8.831       99.999
GET       8.895       99.999
GET       8.959       99.999
GET       8.959       99.999
GET       9.023       99.999
GET       9.023       99.999
GET       9.087       99.999
GET       9.087       99.999
GET       9.151       99.999
GET       9.215       99.999
GET       9.215       99.999
GET       9.279       99.999
GET       9.343       99.999
GET       9.343       99.999
GET       9.343       99.999
GET       9.407       99.999
GET       9.407      100.000
GET       9.407      100.000
GET       9.471      100.000
GET       9.471      100.000
GET       9.471      100.000
GET       9.535      100.000
GET       9.535      100.000
GET       9.535      100.000
[...]
GET       9.599      100.000
GET       9.599      100.000
GET       9.599      100.000
GET       9.663      100.000
GET       9.663      100.000
GET       9.663      100.000
[...]
GET       9.727      100.000
GET       9.727      100.000
---
WAIT      0.000      100.000